namespace MorphAnalyzer {
    public enum MicsTags {
        Abbr, // аббревиатура
        Name, // имя
        Surname, // фамилия
        Patronymic, // отчество
        Toponym, // топоним
        Organisation, // организация
        Trademark, // торговая марка
        Substantivation, // возможна субстантивация
        Superlative, // превосходная
        Qualitative, // качественное
        Apronominal, // местоимённое
        Ordinal, // порядковое
        Possesive, // притяжательное
        Vey, // форма на -ею
        Voy, // форма на -ою
        Comparable2, // сравнительная степень на по-
        Vej, // форма компаратива на -ей
        Impersonal, // безличный
        Impx, // возможно безличное употребление
        Multiple, // многократный
        Reflexible, // возвратный
        Infr, // разговорное
        Slang, // жаргонное
        Arch, // устаревшее
        Litr, // литературный вариант
        Erro, // опечатка
        Dist, // искажение
        Ques, // вопросительное
        Dmns, // указательное
        Prnt, // вводное слово
        Vbe, // форма на -ье
        Ven, // форма на -енен
        Vie, // форма на -и- (веселие, твердостию); отчество с -ие
        Vbi, // форма на -ьи
        Fimp, // деепричастие от глагола несовершенного вида
        Prdx, // может выступать в роли предикатива
        Coun, // счётная форма
        Coll, // собирательное числительное
        Vsh, // деепричастие на -ши
        Afp, // форма после предлога
        Inmx, // может использоваться как одуш. / неодуш. 
        Vpre, // Вариант предлога ( со, подо, ...)
        Anph, // Анафорическое (местоимение)
        Init, // Инициал
        Adjx, // может выступать в роли прилагательного
        Msf, // колебание по роду (м/ж/с): кофе, вольво
        Hypo // гипотетическая форма слова (победю, асфальтовее)
    }
}